# Ejercicio 1

Paso 1: Importar librerías necesarias

In [1]:
import pandas as pd

Paso 2: Importar dataset desde esta dirección: https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv

In [2]:
df = pd.read_table("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv")

Paso 3: Asigna el fichero a un dataframe llamado chipo

In [3]:
chipo = df
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

Paso 4: ¿Cuál es el precio de cada item? <br>
*imprime un dataframe con solo dos columnas: item_name e item_price

In [4]:
chipo[['item_name', 'item_price']]

                                  item_name item_price
0              Chips and Fresh Tomato Salsa     $2.39
1                                      Izze     $3.39
2                          Nantucket Nectar     $3.39
3     Chips and Tomatillo-Green Chili Salsa     $2.39
4                              Chicken Bowl    $16.98
...                                     ...        ...
4617                          Steak Burrito    $11.75
4618                          Steak Burrito    $11.75
4619                     Chicken Salad Bowl    $11.25
4620                     Chicken Salad Bowl     $8.75
4621                     Chicken Salad Bowl     $8.75

[4622 rows x 2 columns]

Paso 5: Ordena el dataframe por el nombre del item

In [5]:
chipo.sort_values(by=['item_name'])

,order_id,quantity,item_name,choice_description,item_price
3389,1360,2,6 Pack Soft Drink,[Diet Coke],$12.98
341,148,1,6 Pack Soft Drink,[Diet Coke],$6.49
1849,749,1,6 Pack Soft Drink,[Coke],$6.49
1860,754,1,6 Pack Soft Drink,[Diet Coke],$6.49
2713,1076,1,6 Pack Soft Drink,[Coke],$6.49
...,...,...,...,...,...
2384,948,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75
781,322,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",$8.75
2851,1132,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",$8.49
1699,688,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25
1395,567,1,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",$8.49

Paso 6: ¿Cuál es la cantidad del item del pedido más caro?

In [6]:
def item_price_to_float(x):
    x = x.replace('$', '')
    return float(x)

item_price_float = chipo['item_price'].apply(item_price_to_float)

chipo.iloc[item_price_float.idxmax()]

order_id                                      1443
quantity                                        15
item_name             Chips and Fresh Tomato Salsa
choice_description                             NaN
item_price                                 $44.25
Name: 3598, dtype: object

Paso 7: ¿Cuántas ensaladas veganas se han pedido?

In [7]:
chipo['item_name'].value_counts().get('Veggie Salad')

6

Paso 8: ¿Cuántas veces ha pedido la gente más de una lata de soda (canned soda)?

In [8]:
soda_rows = chipo.loc[chipo['item_name'] == 'Canned Soda'] # obtener las filas que tienes 'Canned Soda'
soda_rows.loc[chipo['quantity'] > 1].shape[0] # contar las filas que tengan mas de 1 'Canned Soda'

20

# Ejercicio 2: Grupos

Paso 1: importar librerías necesarias

In [9]:
# ya tenemos pandas importado

Paso 2: Importar el dataset desde esta dirección: https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user

In [10]:
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep='|')

Paso 3: asignar los datos a una variable llamada users

In [11]:
users = df
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

Paso 4: ¿Cuál es la edad media por ocupación?

In [12]:
users[['occupation', 'age']].groupby('occupation').mean()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

Paso 5: Descubre cuál es el ratio de mujeres por puesto de trabajo y ordénalo de mayor a menor

AttributeError: 'DataFrameGroupBy' object has no attribute 'value_count'

Paso 6: Por cada puesto de trabajo, calcula la edad máxima y mínima

In [20]:
users.groupby('occupation').max()['age']

occupation
administrator    70
artist           48
doctor           64
educator         63
engineer         70
entertainment    50
executive        69
healthcare       62
homemaker        50
lawyer           53
librarian        69
marketing        55
none             55
other            64
programmer       63
retired          73
salesman         66
scientist        55
student          42
technician       55
writer           60
Name: age, dtype: int64

In [21]:
users.groupby('occupation').min()['age']

occupation
administrator    21
artist           19
doctor           28
educator         23
engineer         22
entertainment    15
executive        22
healthcare       22
homemaker        20
lawyer           21
librarian        23
marketing        24
none             11
other            13
programmer       20
retired          51
salesman         18
scientist        23
student           7
technician       21
writer           18
Name: age, dtype: int64

Paso 7: Calcula la edad media para cada tipo de trabajo y género

In [23]:
users.groupby(['occupation', 'gender']).mean()['age']

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

Paso 8: Para cada tipo de trabajo, muestra el porcentaje de hombres y mujeres

# Ejercicio 3: Merge

Repaso: info interesante sobre joins / merge https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/

paso 1: importa las librerías necesarias

In [ ]:
# ya tenemos pandas importado

Paso 2: Crea 3 DataFrames basándote en el estos datos

In [14]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

Paso 3: Asigna cada uno a las variables data1, data2, data3

Paso 4: Une los 2 primeros dataframes (por filas) y asígnalos a la variable all_data

Paso 5: Une los dos dataframes por columnas y asigna el resultado a all_data_col

Paso 6: Imprime los datos data3

Paso 7: Une all_data y data3 por la columna subject_id

Paso 8: Une solo los datos que tengan el mismo subject_id en data1 y data2

Paso 9: Une todos los valores data1 y data2, cruzando aquellos registros que coincidan en ambas tablas

# Ejercicio 4: Borrado

Paso 1: importa todas las librerías necesarias

In [ ]:
# ya tenemos pandas importado

Paso 2: importa los datos desde esta dirección: https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data

In [40]:
df = pd.read_table("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data", sep=',', header=None)

Paso 3: asigna los datos a la variables wine

In [41]:
wine = df.copy()
wine.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

Paso 4: Borra la primera, cuarta, septima, novena, decimoprimera, decimotercera y la decimocuarta columnas

Paso 5: Asigna las columnas como se indica a continuación:

1) alcohol
2) malic_acid
3) alcalinity_of_ash
4) magnesium
5) flavanoids
6) proanthocyanins
7) hue

Paso 6: Asigna los valores de las primeras 3 filas de la columna alcohol a NaN

Paso 7: Asigna las filas 3 y 4 de la columna magnesio a NaN

Paso 8: Asigna los valores 10 en alcohol y 100 en magnesio a los datos que sean NaN

Paso 9: Cuenta la cantidad de datos faltantes

Paso 10: Borra las columnas que contengan valores NaN

Paso 15: Resetea el index para que empiece desde 0 otra vez